#include <stdio.h>




//==============================================
//==============================================
//==============================================
//==============================================
////函数指针
//int  test(int y,int x)
//{
//	return y + x;
//}
//void main()
//{	
//	//取地址函数名和函数名的都是函数地址(效果一样)
//	printf("%p\n",&test);
//	printf("%p\n",test);
//	int (*pc)(int,int) = test;//存放函数地址的方式
//	printf("%d\n",(*pc)(2,3));
//}
//==============================================
//void test(int (*arr)[5])
//{}
//void main()
//{
//	int arr[3][5] = { 0 };
//	test(arr);
//}