#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h> //标准输出输入库文件





//============================================================================================
//int Pdd = 222;
//============================================================================================
static int Pdd = 222;//改变了变量的作用域一让静态的全局变量只能在自己所在的源文件内部使用
//============================================================================================
static int add(int y, int x)//
////static----定义修饰成静态函数
////也是改变了函数的作用域-说法不准确
////static修饰函数改变了函数的链接属性
////外部（就是外部文件也能引用）链接属性->内部（只能在自己所在的源文件内部使用）链接属性
{
	int z = y + x;
	return z;
}
//============================================================================================