#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>



//===========================================================
//===========================================================
//===========================================================
//void test(int (*p)[5],int x,int y)
//{
//	int i = 0;
//	for (i=0;i<x;i++)
//	{
//		int j = 0;
//		for (j=0;j<y;j++)
//		{
//			printf("%d ",*(*(p+i)+j));
//		}
//		printf("\n");
//	}
//}
//void main()
//{
//	int arr[3][5] = { {1,2,3,},{2,3,4},{3,4,5}};
//	test(arr,3,5);
//}
//===========================================================
////二级数组指针
//void main()
//{
//	char* arr[10];
//	char* (*p)[10] = &arr;
//}
//===========================================================
////数组指针
//void main()
//{
//	int* p = NULL; //p是整形指针-指向整形的指针--可以存放整形的地址
//	char* pc = NULL;//pa是字符指针-指向字符的指针--可以存放字符的地址
//	int arr[10] = { 0 };//数组指针-指向数组的指针--可以存放数组的地址
//	int(*p)[10] = &arr;
//	//上面的p就是数组指针
//  //打印printf("%d "，(*pa)[i]);
//}